services/graphql-api/load-tests/load-test.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  processor: "./load-test-helpers.js"
  plugins:
    metrics-by-endpoint:
      stripQueryString: true

scenarios:
  - name: "List campaigns"
    weight: 40
    flow:
      - post:
          url: "/graphql"
          json:
            query: |
              query ListCampaigns($limit: Int!) {
                campaigns(limit: $limit) {
                  id
                  title
                  goal
                  totalRaised
                  status
                }
              }
            variables:
              limit: 20
          capture:
            - json: "$.data.campaigns[0].id"
              as: "campaignId"

  - name: "Campaign detail"
    weight: 30
    flow:
      - post:
          url: "/graphql"
          json:
            query: |
              query CampaignDetail($id: ID!) {
                campaign(id: $id) {
                  id
                  title
                  description
                  goal
                  totalRaised
                  deadline
                  status
                  creator
                  contributorCount
                }
              }
            variables:
              id: "{{ $randomString() }}"

  - name: "Search campaigns"
    weight: 20
    flow:
      - post:
          url: "/graphql"
          json:
            query: |
              query SearchCampaigns($query: String!, $limit: Int!) {
                searchCampaigns(query: $query, limit: $limit) {
                  id
                  title
                  totalRaised
                  status
                }
              }
            variables:
              query: "tech"
              limit: 10

  - name: "Campaign stats"
    weight: 10
    flow:
      - post:
          url: "/graphql"
          json:
            query: |
              query CampaignStats($id: ID!) {
                campaignStats(id: $id) {
                  totalRaised
                  contributorCount
                  progressBps
                  averageContribution
                }
              }
            variables:
              id: "{{ $randomString() }}"